<template>
  <div>
    <el-table :data="tableData" height="100vh" border style="width: 100%">
      <el-table-column type="expand">
        <template slot-scope="props">
          <div v-for="(item, index) in props.row.detail" :key="index" style="margin-bottom: 10px;">
            {{ item.content }}
          </div>
        </template>
      </el-table-column>
      <el-table-column prop="name" label="活动名称">
      </el-table-column>
      <el-table-column prop="date" label="活动日期">
      </el-table-column>
      <el-table-column prop="content" label="简述">
      </el-table-column>
    </el-table>
  </div>
</template>

<script>
export default {
  data: function () {
    return {
      tableData: [
        {name: '眩惑之塔', date: '/', content: '每日一次'},
        {name: '泰波尔斯引导', date: '/', content: '每周四刷新，一周六次，一天三次'},
        {name: '超时空漩涡单人本', date: '/', content: '/'},
        {name: '代号·希望', date: '/', content: '每周一刷新，一周三次'},
        {name: '中央竞技场', date: '/', content: '每周一刷新，一周三次，一日一次'},
        {name: '周常地下城', date: '/', content: '每周四刷新，换超·星空裂缝通行证礼盒，强化器，增幅器'},
        {name: '灾难领域', date: '/', content: '每周二刷新，一周十次'},
        {name: '周末签到享惊喜', date: '2019.11.28~2020.1.14（还剩两周）', content: '每周六06：00~周一05：59签到'},
        {name: '阳光少女成长记', date: '2019.11.28~2019.12.24（还剩两周）', content: '每天下线前养一会'},
        {name: '史诗之路', date: '2019.12.10~2020.1.14（五周）', content: '5次左右（10疲劳一次）', detail: [{content: '星河裂缝：【入场】每日10次，不消耗疲劳和门票，【掉落】落泰波尔斯史诗装备与超界史诗装备，1个辉煌的金色气息'}, {content: '超·星河裂缝：【入场】10点疲劳值与1个波塞姆的祝福花瓣（每天送3个，3个精炼的时空石换1个），【掉落】泰波尔斯史诗装备和超界史诗装备，隐藏BOSS直接掉落1~5件超界史诗装备，3~5个辉煌的金色气息，及1~2个权能碎片'}, {content: '需要：异界气息净化书(50*2) + 泰波尔斯史诗特殊装备礼盒(100*1) + 永恒的黑瞳石礼盒（8个）(100*5) + 反物质粒子（16个）(60*5) = 1000'}, {content: '实现：星河裂缝10*35*1 + 超·星河裂缝3*35*4 = 770，需要58张门票'}, {content: '注意：掉落的史诗装备无法分解，但可以出售。星河裂缝不属于推荐地下城，但超·星河裂缝属于推荐地下城。'}]},
        {name: '南瓜球的新商机', date: '2019.12.10~2020.1.14（五周）', content: '/', detail: [{content: '需要：奇怪的扭转书(25*1) + 奇怪的增幅器材料礼盒(20*5) = 125'}, {content: '实现：3*35*1.5 + 58 = 215，完成【史诗之路】即可'}, {content: '注意：使用奇怪的增幅器进行增幅时需要一定量的金币与未知的材料。'}]},
        {name: '冒险者的游戏', date: '2019.12.10~2020.1.14（五周）', content: '2次', detail: [{content: '冒险者的游戏：【入场】每天2次，【掉落】稀有~神器守护珠，精炼的时空石，龙之硬币（按到达终点顺序：3个，2个，1个）'}, {content: '需要：传说勋章自选礼盒(15*1) + 神器守护珠自选礼盒(25*1) + 满属性首饰宝珠自选礼盒(40*1) + 首饰宝珠自选礼盒(15*2) + 满属性特殊装备宝珠自选礼盒(40*1) + 特殊装备宝珠自选礼盒(15*2) = 180'}, {content: '实现：180/35/2 = 2.6，不能一天2次都是第二名'}, {content: '注意：双开可稳定收益。'}]},
        {name: '休息，休息一会', date: '2019.12.10~2020.1.14（五周）', content: '睡觉', detail: [{content: '需要：反物质粒子（10个）(100*5) + 苍穹碎片（100个）(80*5) + 超 · 星空裂缝通行证(15*4*5) = 1200'}, {content: '实现：睡觉'}]},
        {name: '雪球奇缘', date: '2019.12.10~2020.1.14（五周）', content: '遇到2次以上', detail: [{content: '推荐地下城：【入场】每消耗20点疲劳后推荐地下城中碰到雪人哥布林，每天最多可以碰到3次雪人哥布林，【掉落】5个沁凉雪球'}, {content: '需要：深渊之鳞套装武器自选礼盒(55*1) + 胜 · 深渊之鳞武器转换书(75*1) + 深渊之鳞装备自选礼盒（武器除外）(40*3) + 黑暗之眼灵能碎片礼盒（100个）(10*2*5) = 350'}, {content: '实现：350/35 = 10，每天10个沁凉雪球即可'}, {content: '雪人哥布林不会在泰波尔斯地下城及代号希望地下城中出现，组队情况下每个玩家都会得到5个任务材料。'}]},
        {name: '阿拉德探险记', date: '2019.12.10~2020.3.19（100天）', content: '完成每日、每周、赛季任务', detail: [{content: '【每日任务】：3个，每个100点经验，【每周任务】：4个，每个1000点经验，【赛季任务】：18个，每个1600点经验，【商城】消费额度50%的经验'}, {content: '需要：80*1300 = 104000'}, {content: '实现：100*3*100 + 14*4*1000 + 1*18*1600 = 114800，需要几乎完成所有任务'}]}
      ]
    }
  }
}
</script>

<style scoped>

</style>
